[
  {
    "time": "July 2024 - Present",
    "title": {
      "company": "Prickly Pear Health Inc.",
      "role": "Founding Engineer"
    },
    "body": "Architected iOS app for perimenopausal women using MVVM+Coordinator in SwiftUI, implementing RAG with GPT-4o and on-device LLM using MLX, achieving 98% crash-free rate and processing 10,000+ daily journals with HealthKit, Oura Ring and Fitbit integration. Engineered voice processing pipeline (AVFoundation, Speech) with <100ms latency and offline-first SwiftData architecture, while scaling backend with Bun/Hono to handle 500+ concurrent users at 99.9% uptime. Deployed HIPAA-compliant AWS infrastructure (EC2, ECS, RDS, S3) using Terraform, contributed to LlamaStack iOS framework, and implemented end-to-end encryption with Supabase auth.",
    "link": {
      "text": "Prickly Pear Health Inc",
      "url": "https://www.pricklypear.io/"
    },
    "type": "work",
    "logo": "pphealth.jpeg"
  },
  {
    "time": "September 2023 - May 2024",
    "title": {
      "company": "PNYX.xyz",
      "role": "iOS Developer (Volunteer)"
    },
    "body": "Contributed to NYX, a gamified platform for unreleased music A/B testing and pre-release campaigns, inspired by 'The Voice' show's blind auditions concept. Implemented high-performance audio streaming playback using AVFoundation and custom caching mechanisms. Integrated dual payment systems: Apple Pay for traditional transactions and Web3 payments using Coinbase API and MetaMask SDK for blockchain transactions. Developed a seamless user experience for music discovery and artist perks redemption (Spotify pre-saves, merchandise, show tickets) while maintaining user anonymity during blind testing phases.",
    "link": {
      "text": "Pnyx.xyz",
      "url": "https://pnyx.xyz"
    },
    "type": "volunteer",
    "logo": "pnyx.jpeg"
  },
  {
    "time": "June 2023 - May 2024",
    "title": {
      "company": "Dhan AI Pvt. Ltd.",
      "role": "Software Development Engineer - I"
    },
    "body": "Led OAuth migration from SAP Gigya to Firebase Auth for the iOS/iPadOS app and web backend, enhancing Identity and Access Management (IAM) security for 50,000+ users without necessitating password resets. Synchronized data across 3 platforms in real-time, utilizing multi-threading, RabbitMQ, and Redis for caching, to ensure seamless integration and data consistency. Developed an innovative admin system using JSON Web Tokens (JWT) to simulate user sessions, significantly improving debugging capabilities while maintaining single sign-on (SSO) and two-factor authentication standards.",
    "link": {
      "text": "Dhan AI Pvt. Ltd.",
      "url": "https://dhan.ai/"
    },
    "type": "work",
    "logo": "dhan.jpeg"
  },
  {
    "time": "July 2022 - May 2023",
    "title": {
      "company": "Decision Theater Lab at Arizona State University",
      "role": "Student Software Developer"
    },
    "body": "Contributed to Project SHELDUS in coordination with the Department of Defense, maintaining and categorizing natural disaster data from 1960 to present. Developed REST APIs using Flask and Python, implementing efficient queries for data retrieval and analysis. Collaborated with researchers to enhance data visualization and reporting capabilities.",
    "link": {
      "text": "Decision Theater Lab at ASU",
      "url": "https://dt.asu.edu/"
    },
    "type": "work",
    "logo": "fulton.jpeg"
  },
  {
    "time": "August 2021 - July 2022",
    "title": {
      "company": "Arizona State University, Ira A Fulton Schools of Engineering",
      "role": "Graduate Teaching Assistant"
    },
    "body": "Served as a Graduate Teaching Assistant to Prof. Maria Chavez and Prof. Mohd. Taher, instructing over 150 students in the Fulton School of Engineering. Taught programming fundamentals using MATLAB and Python to 100+ undergraduate and graduate students, and guided them through hands-on projects with Raspberry Pi as part of FSE-100: Introduction to Engineering.",
    "link": {
      "text": "One of my lecture videos",
      "url": "https://www.youtube.com/watch?v=QZYDNiXelfc"
    },
    "type": "work",
    "logo": "fulton.jpeg"
  },
  {
    "time": "August 2021 - May 2023",
    "title": {
      "company": "Arizona State University",
      "role": "Master of Science in Computer Science (M.S. CS)"
    },
    "body": "Major: Computer Science. Minor: Cybersecurity. Relevant Coursework: CSE-539 Applied Cryptography, CSE-511 Data Processing at Scale, CSE-575 Statistical Machine Learning, CSE-576 Natural Language Processing, and CSE-545 Software Security. GPA: 3.89/4.00",
    "type": "education",
    "link": {
      "text": "Arizona State University, Tempe AZ",
      "url": "https://asu.edu/"
    },
    "logo": "asu.jpeg"
  },
  {
    "time": "June 2019 - July 2021",
    "title": {
      "company": "Compliance Group Inc.",
      "role": "Full-stack Developer"
    },
    "body": "Led backend development of FDAlytics and iQuality using Python, Django REST Framework, and GraphQL, achieving 20% improvement in data processing efficiency. Collaborated with a team of 6 developers to create a data categorization module, significantly enhancing retrieval speed and accuracy using Azure Search. Implemented testing and deployment pipelines using PyTest, Jest, and GitHub Actions for CI/CD, reducing deployment errors by 50% and improving deliverable quality.",
    "link": {
      "text": "FDAlytics",
      "url": "https://fdalytics.com/"
    },
    "type": "work",
    "logo": "fdalytics.jpeg"
  },
  {
    "time": "September 2018 - May 2019",
    "title": {
      "company": "AuthBase Inc.",
      "role": "Software Engineer"
    },
    "body": "Developed LiveShield, leveraging ElasticSearch, Logstash, and Kibana (ELK) for dynamic scanning of 10,000+ DLLs, enhancing real-time security analytics and alerts using socket.io. Integrated Nessus and NMap-based packet sniffers for in-depth vulnerability scans, utilizing NVD and CVE for robust threat management. Achieved 40% improvement in security effectiveness, aligning with NVD advisories and CVSS risk assessments.",
    "link": {
      "text": "AuthBase Inc.",
      "url": "https://authbase.net/"
    },
    "type": "work",
    "logo": "authbase.jpeg"
  },
  {
    "time": "May 2017 - July 2017",
    "title": {
      "company": "Nuclear Fuel Complex, Department of Atomic Energy, Government of India",
      "role": "Software Engineering Intern"
    },
    "body": "Developed a Job Scheduling and Inventory Management application for the Zirconium Fabrication Plant. Distinguished as the only Computer Science major intern in the department. Implemented REST APIs using Flask and Python, with efficient database queries for real-time data retrieval and processing.",
    "link": {
      "text": "Nuclear Fuel Complex",
      "url": "https://www.nfc.gov.in/"
    },
    "type": "work",
    "logo": "nfc.jpeg"
  },
  {
    "time": "May 2016 - July 2016",
    "title": {
      "company": "HCL Computers Ltd.",
      "role": "Software Engineering Intern"
    },
    "body": "Built a Proof of Concept application implementing the IEEE Standard for Privacy-Preserving Data Sharing with Anonymous ID Assignment in healthcare. Developed a secure web application using ASP.NET and C# for hospitals and clinics to manage patient records with robust privacy controls.",
    "link": {
      "text": "HCL Computers Ltd.",
      "url": "https://www.hcltech.com/"
    },
    "type": "work",
    "logo": "hcl.jpeg"
  },
  {
    "time": "August 2014 - May 2018",
    "title": {
      "company": "Panjab University",
      "role": "Bachelor of Engineering in Computer Science and Engineering (B.E. CSE)"
    },
    "body": "Major: Computer Science and Engineering. Relevant Coursework: CS-505 Computation and Automata Theory, CS-705 Cyber Law, CS-503 Artificial Intelligence and Expert Systems, CS-703 Digital Image Processing, and CS-605D Mobile Application Development (iOS). GPA: 7.77/10.00",
    "link": {
      "text": "Panjab University, Chandigarh",
      "url": "https://puchd.ac.in/"
    },
    "type": "education",
    "logo": "uiet.jpeg"
  }
]
